# StructuralSectionCProfileWithFold Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionCProfileWithFold Class
Members See Also
---
Defines parameters for C Profile with fold structural section.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class StructuralSectionCProfileWithFold : StructuralSectionGeneralCEx
```

Visual Basic
---
```text
Public Class StructuralSectionCProfileWithFold _
	Inherits StructuralSectionGeneralCEx
```

Visual C++
---
```text
public ref class StructuralSectionCProfileWithFold : public StructuralSectionGeneralCEx
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionColdFormed Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralCEx Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionCProfileWithFold
# See Also
StructuralSectionCProfileWithFold Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace